[ {
        "id": "DreamerSteve",
        "name": "Dreamer steve",
        "description": "The very first game project I worked on that was somewhat finished, it was a fun but very chaotic experience. Especially since we had designed someone elses game and the game we ended up with was also  designed by others, we simply changed things we ended up not liking.",
        "fullDescription": "This was the first project we made for this semester and it being the first had some issues and restrictions. The restrictions were simple, it had to be one of a few genres, we choose platfomer with 3D dimension. It had to be small, couldn't be larger than a few levels. We started with the documentation process and it had a fun twist, we gave our 1 page document to a different group, they had to make a 10 pager out of it for us and we for them. It was intressting to see what they made from our concept and we tried to stick to that design document, however we quickly learned that it wasn't possible. We made a few changes and to keep the game fun additions, like a grapple hook. I helped with multiple aspects of the game, from mechanics to level design. It was a chaotic but fun project to work on, I definitly had a lot of fun and learned a lot from it.",
        "semester": "Semester 4",
        "link": "https://github.com/Dreamer-steve-Project/Dreamer-Steve",
        "technologies": [
            "unity",
            "visual studio",
            "c#",
            "git",
            "agile",
            "scrum",
            "windows"
        ],
        "features": [
            "Game Design",
            "Game Development",
            "Real testing",
            "Scrum Agile workflow"
        ],
        "category": "Game Design",
        "company": "Fontys",
        "images": [
            "./images/dreamersteve.png"
        ],
        "prideLevel": "proud"
    },
    {
        "id": "CloudPeak",
        "name": "Cloud Peak",
        "images": [
            "./images/Cloudpeak.png",
            "./images/Cloudpeak2.png",
            "./images/cloudpeakmap.gif"
        ],
        "video": "videos/cloudpeak.mp4",
        "description": "This was a stressfull project, as it happened together with DreamerSteve, but it was an intressting time. It took longer to create the concept than we had anticipated, which should have been something we expected as this was our first project with only two people.",
        "fullDescription": "Like with Dreamer steve, this project had to be small and was restricted to a few genres, we choose 2d dungeon crawler. The game was created with Unity and C#.This project was a lot more difficult than Dreamer steve, mainly because of the genre we had choosen. Because we still didn't have a lot of expereince with the engine and the way documentation is writing for a project like this. I worked on some of the art, though some of it wasn't used due to time. I created the dungeon randomizer to have more dynamic levels. Created the UI for the map as well, and ofcourse helped with designing the mechanics and dynamics. It was a very challenging project and it definitly didn't end up how we had thought it would. .",
        "semester": "Semester 4",
        "link": "https://github.com/BenDBrown/Cloudpeak-YOG",
        "technologies": [
            "unity",
            "c#",
            "git",
            "visual studio",
            "windows"
        ],
        "features": [
            "Game Design",
            "Game Development",
            "Scrum Agile workflow"
        ],
        "category": "Game Design",
        "company": "Fontys",
        "prideLevel": "proud"
    },
    {
        "id": "KnifeCrime",
        "name": "Knife crime",
        "description": "This was the first game design project I did for an actuall client and my first experience with applied gaming, it was so much fun to try to create an applied gaming solution to help reduce the teens with knifes on the street. It was super hard, but that helped with learning a lot. ",
        "fullDescription": "During the production of KnifeCrime I worked mostly on the level design and the sound/music design. I managed a small team of 4 total inculding me to, it went alright, lookign back there are some improvements that I would have made to my management, that I did implement in my short time as scrum master of Voidscape. I learned a lot about makeing level deisgn and sound because that is what I worked on, but the more usefull things I learned during this project was that I enjoyed doing this enourmesly. Trying to figure out how we can get this message across and still have a fun game, was an immensly fun task to tackle. Did we succeed? Not entirely, but we got close, people did enjoy it, just the message did not really get across.",
        "semester": "Semester 4",
        "images": [
            "./images/kc1.png",
            "./images/kc2.png",
            "./images/kc3.png",
            "./images/kc4.png"
        ],
        "videos": [
            "./videos/kc_trailer.mp4",
            "./videos/fmod.mp4"
        ],
        "link": "https://github.com/davey2206/Knife_Crime",
        "technologies": [
            "unity",
            "c#",
            "git",
            "visual studio",
            "gpt",
            "fmod",
            "windows"
        ],
        "features": [
            "Game Design",
            "Game Development",
            "Scrum Agile workflow",
            "Narrative",
            "Music"
        ],
        "category": "Game Design",
        "company": "Industry Project Fontys Partner",
        "prideLevel": "very-proud"
    },
    {
        "id": "HelpRoby",
        "name": "Help roby",
        "description": "This was a difficult project, as I worked together with another student, we were both trying to do something we haven't done before. Working with robotica, this was the work of the other student and working with AI/LLM, which was my job. I did not like the project much by the end, due to frustrations with the AI ",
        "fullDescription": "This project was done for my internship at PIT, I tried with a fellow student to create a solution, eventually a  game, for helping rescue children to learn dutch. I created most of the games concept which is as follows; The game has a robot that one student controls across a room in real life, while the robot in game follows the movement. Others tell this student in dutch, which direction they need to go or are dangers. Some of the dangers/obstacles are not avoidable and have to be overcome by creating a strucutre from lego. They can than scan this scruture and it will appear in game. They will hear the dutch word and the idea is that through doing this they get a connection to the word and would be able to remember it. I did a lot of research on this front and it is true that when children are more physically active it can elevate the learning process. I was responsible for the overall game design, level design and the AI. My fellow stuudent was resposible for the robot and it's interaction to the game and giving me information to use in the AI. It went well and I learned that AI is much more difficult than anticipated. In the end the client was happy with the result and we could see that the students did end up at least interacting more and picking up a little dutch. For me the project was cut short due to personal reasons. I did not see this project through the end sadly. One of the gifs shows a screenshot maker I created to get the image of the website the camera was broadcasting to, because my fellow student coulnd't figure out how to send the information to me.",
        "semester": "Semester 5",
        "images": [
            "./images/HelpRoby.png",
            "./images/HelpRoby2.png"
        ],
        "video": "videos/HelpRoby.mp4",
        "technologies": [
            "unity",
            "c#",
            "git",
            "visual studio",
            "gpt",
            "python",
            "windows"
        ],
        "features": [
            "Game Design",
            "Game Development",
            "AI",
            "Lego Recognition",
            "Narrative"
        ],
        "category": "Internship",
        "company": "Practoraat Interactieve Technologie (A.K.A PIT) Tilburg",
        "prideLevel": "proud"
    },
    {
        "id": "EscapeRoomVR",
        "name": "Escape Room VR Project",
        "description": "This was a very intresting project, working with VR was not the easiest thing, mostly due to Unity not wanting to preform well, as well as some challenges I had not originally considered. I did reach a prototype that I am happy with, it managed to make the students learn something in a fun manner. ",
        "fullDescription": "The project was my second internship also at PIT, as I failed the first. In this project I tried to create a solution for another teacher this time for the beauty specialist course. The goal of the project was to make the students more engaged with the material of the course. They had already tried many solutions before, this includes, interactive website, online work book, kahoot. They saw from this that Kahoot showed the most promise and that they believed it to be because of the fact it was a game, rather than tyical education method.In order to find the best solution, also based upon what they have expereienced and my skills, we came to the conclusion to try a game. The game would need to be as easy as possible to use, as the target audience for this isn't made of gamers. It would also need a hook,  for these students to even engage with the project. With some heavy brainstorm sessions and talking with other teachers at PIT, we came up with the idea to create a puzzle VR game, which eventually became the Escape Room VR project. They way it would work is as followed; You put on the Meta quest 2 and go into the game, once in the game and in the level, you are tasked with hanging  pictures of skin conditions on the right hook, depended on the hint you got. In the end the client was very happy with the result as we managed to get the students be able to do something related to their course. They found this way of learning their material more engaging, which is what we wanted. ",
        "semester": "Semester 5",
        "images": [
            "./images/EscapeRoom.png",
            "./images/EscapeRoom2.png"
        ],
        "video": "videos/EscapeRoomDemo.mp4",
        "technologies": [
            "unity",
            "c#",
            "git",
            "visual studio",
            "windows",
            "vr",
            "linux"
        ],
        "features": [
            "Game Design",
            "Game Development",
            "VR",
            "Puzzle"
        ],
        "category": "Internship",
        "company": "Practoraat Interactieve Technologie (A.K.A PIT) Tilburg",
        "prideLevel": "proud"
    },
    {
        "id": "MusicSystemGodot",
        "name": "Music System for Godot",
        "description": "Still working on this one, hence no picture,  it is meant to be a plugin that will allow other student designers to add dynamic music to their scene's with more of an ease  than it would normally have. Because a lot of the time that is what is missing in projects, the music in the game. It can really amplify a moment and it is felt when it is missing.",
        "fullDescription": "Music pack  and system for Godot, still under development",
        "link": "https://github.com/MelodyTheMuse/MusicPackSystemDeepDive",
        "semester": "Semester 6",
        "technologies": [
            "godot",
            "gdscript",
            "linux",
            "windows",
            "github",
            "github desktop",
            "visual studio code"
        ],
        "features": [],
        "category": "Game Design Advanced",
        "company": "Fontys",
        "prideLevel": "proud"
    },
    {
        "id": "Voidscape",
        "name": "Voidscape",
        "description": "This game is the one of my favourite projects as of yet, it was a lot of fun to work on, we worked on it with a group of friends with the hopeful idea to create our own company for from it. I worked on the implementation of the AI, our boosting mechanic as well as a level design, I also started working on my Interactables plugin that makes it easier to allow other designers to add interactables. Working with Godot was a treat as well, especially because it was a better workflow.",
        "fullDescription": "During the production of voidscape I worked on the NPC behaviour for a good chunck, I learend a lot  especially with the difficult implementation we had for the ship in the game. Like that when creating this behaviour next time, we should just let the NPC have their own physics and not the exact same one as the player, because it will be pain. Working on the blinking feature was a lot more fun, learned a lot more about the Rigidbody and the characterbody for this engine. At the end of the project I created and enemy outpost, which was pretty okay, strapped for time I did the best version I could make in the time frame,  as well as a Astroid that always makes people laugh at how fast that thing zips through the game, not the best thing, but people are having fun and that is all that I wanted to happen with it, so that's a win in my book. Compared to the other projects, this was not as smooth as some, but in terms of what I learned and could do it was definitly my best and favourite. I learned a new Engine, that I love now, learned  better practices to work with a group. It ",
        "images": [
            "./images/Voidscape.png"
        ],
        "video": "./videos/Trailer_Voidscape_RV2.mp4",
        "link": "https://github.com/BenDBrown/VoidScape",
        "semester": "Semester 6",
        "technologies": [
            "godot",
            "gdscript",
            "c#",
            "github",
            "visual studio code",
            "github desktop",
            "linux",
            "windows"
        ],
        "features": [],
        "highlighted": true,
        "category": "Game Design Advanced",
        "company": "Fontys",
        "prideLevel": "very-proud"
    }
]